Repository: 84000/translation-memory-resources
Catalog: post_input/toh70.bo.en.tmx
Source language: bo
Languages: en

source: འཕགས་པ་ ལག་ བཟངས་ ཀྱིས་ ཞུས་པ་ ཞེས་ བྱ་བ་ ཐེག་པ་ ཆེན་པོ འི་ མདོ །_
en: The Noble Great Vehicle Sūtra The Question of Subāhu

source: སངས་རྒྱས་ དང་ །_ བྱང་ཆུབ་ སེམས་དཔའ་ ཐམས་ཅད་ ལ་ ཕྱག་ འཚལ་ ལོ །_།
en: $1 [154.a] Homage to all buddhas and bodhisattvas.

source: འདི་སྐད་ བདག་ གིས་ ཐོས་པ་ དུས་ གཅིག་ ན །_
en: $2 Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་ རྒྱལ་པོ འི་ ཁབ་ ན་ འོད་མ འི་ ཚལ་ བྱ་ ཀ་ ལན་ ད་ ཀ འི་ གནས་ ན །_
en: The Blessed One was at the Kalandaka­nivāpa in the Veṇuvana, by Rājagṛha,

source: དགེ་སློང་ གི་ དགེ་འདུན་ ཆེན་པོ་ དང་ ཐབས་ཅིག་ ཏུ་ བཞུགས་ ཏེ །_
en: together with a great assembly of monks.

source: དེ འི་ ཚེ་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ ལག་ བཟངས་ ཞེས་ བྱ་བ་ གཡོག་ དང་ བཅས་ ཏེ །_
en: At that time a bodhisattva great being named Subāhu set out with his servants

source: རྒྱལ་པོ འི་ ཁབ་ ཀྱི་ གྲོང་ཁྱེར་ ཆེན་པོ་ ནས་ བྱུང་ ནས་ འོད་མ འི་ ཚལ་ བྱ་ ཀ་ ལན་ དཀ འི་ གནས་ ག་ལ་བ་ དང་ །_
en: from the city of Rājagṛha for the Kalandaka­nivāpa in the Veṇuvana,

source: བཅོམ་ལྡན་འདས་ ག་ལ་བ་ དེར་ སོང་ སྟེ་
en: where the Blessed One was staying.

source: ཕྱིན་ ནས་ བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ཏེ་
en: As soon as he arrived, Subāhu touched his head to the feet of the Blessed One,

source: བཅོམ་ལྡན་འདས་ ལ་ ལན་ གསུམ་ བསྐོར་བ་ བྱས་ ནས་ ཕྱོགས་ གཅིག་ ཏུ་ འདུག་ གོ _།
en: circumambulated him three times, and sat down to one side.

source: ཕྱོགས་ གཅིག་ ཏུ་ འདུག་ ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ ལག་ བཟངས་ ཀྱིས་ བཅོམ་ལྡན་འདས་ ག་ལ་བ་ དེ་ ལོགས་ སུ་ ཐལ་མོ་ སྦྱར་བ་ བཏུད་ དེ་ བཅོམ་ལྡན་འདས་ ལ་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: With palms joined, the bodhisattva great being Subāhu bowed to the Blessed One and asked him,

source: བཅོམ་ལྡན་འདས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ ཆོས་ དུ་ དང་ ལྡན་ ན་ མྱུར་ དུ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ མངོན་པར་ རྫོགས་པ ར་ འཚང་ རྒྱ །_
en: “Blessed One, what are the qualities bodhisattva great beings should have if they are to awaken swiftly and completely to unsurpassed and perfect awakening?”

source: བཅོམ་ལྡན་འདས་ ཀྱིས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ ལག་ བཟངས་ ལ་ འདི་སྐད་ ཅེས་ བཀའ་ སྩལ་ ཏོ །_།
en: $3 The Blessed One replied to the bodhisattva great being Subāhu as follows:

source: ལག་ བཟངས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ ས་ མྱུར་ དུ་ མངོན་པར་ རྫོགས་པ ར་ བྱང་ཆུབ་ པར་ བྱ་བ འི་ ཕྱིར་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ དྲུག་པོ་ འདི་དག་ རྟག་པ ར་ རྒྱུན་ དུ་ ཡོངས་སུ་ རྫོགས་པ ར་ བྱ འོ །_།
en: “Subāhu, if bodhisattva great beings are to awaken swiftly and perfectly, they must constantly and relentlessly complete the six perfections.

source: དྲུག་ གང་ཞེ་ན །_
en: What are these six?

source: སྦྱིན་པ འི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ དང་ །_
en: They are the perfection of generosity,

source: ཚུལ་ཁྲིམས་ ཀྱི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ དང་ །_
en: the perfection of ethical discipline,

source: བཟོད་པ འི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ དང་ །_
en: the perfection of patience,

source: བརྩོན་འགྲུས་ [154b] ཀྱི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ དང་ །_
en: the perfection of diligence, [154.b]

source: བསམ་གཏན་ གྱི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ དང་ །_
en: the perfection of concentration, and

source: ཤེས་རབ་ ཀྱི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ སྟེ །_
en: the perfection of insight.

source: ལག་ བཟངས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ ས །_ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ དྲུག་པོ་ འདི་དག་ རྟག་པ ར་ རྒྱུན་ དུ་ ཡོངས་སུ་ རྫོགས་པ ར་ བྱ འོ །_།
en: Subāhu, bodhisattva great beings must constantly and relentlessly complete these six perfections.”

source: ལག་ བཟངས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ ཇི་ལྟ ར་ སྦྱིན་པ འི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ ཡོངས་སུ་ རྫོགས་པ ར་ བྱེད་ ཅེ་ན །_
en: $4 “Subāhu, how do bodhisattva great beings complete the perfection of generosity?

source: ལག་ བཟངས་ འདི་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ ནི་ ཆོས་ ཀྱིས་ ལོངས་སྤྱོད་ རྣམས་ ཡོངས་སུ་ ཚོལ་ གྱི་ ཆོས་མ་ ཡིན་པ ས་ ནི་ མ་ ཡིན་ ནོ །_།
en: Subāhu, they seek resources in accordance with the Dharma, and not contrary to the Dharma.

source: མཉམ་པ ས་ ཡིན་ གྱི་ མི་མཉམ་པ ས་ ནི་ མ་ ཡིན་ ནོ །_།
en: They practice generosity without bias, and not with bias.

source: དེ་ སྲོག་ཆགས་ གཞན་དག་ དང་ །_ སེམས་ཅན་ གཞན་ རྣམས་ ལ་ གནོད་པ་ མི་ བྱེད །_ ཉམ་ང་བ་ མི་ བྱེད་པ ར་ སྦྱིན་པ་ སྦྱིན་ ཏེ །_
en: They practice generosity without harming or causing distress to creatures or other beings.

source: བརྗོད་པ་ དང་ །_ སྒྲ་ དང་ ཚིགས་ སུ་ བཅད་པ འི་ ཕྱིར་ མ་ ཡིན །_
en: It is not done for fame, reputation, or praise.

source: འཛེམ་པ འི་ ཕྱིར་ མ་ ཡིན །_ འཇིགས་པ འི་ ཕྱིར་ མ་ ཡིན །_
en: It is not done out of cowardice, fear,

source: ལན་ དུ་ ཕན་ འདོགས་ སུ་ རེ་བ འི་ ཕྱིར་ མ་ ཡིན །_ མཐོ་རིས་ ཀྱི་ ཕྱིར་ མ་ ཡིན །_
en: hoping for reward, or for the sake of a high rebirth.

source: ཚུལ་འཆོས་པ་ མ་ ཡིན །_ ཁ་གསག་ བྱེད་པ་ མ་ ཡིན །_ བརྙས་པ་ མ་ཡིན་པ འོ །_།
en: It does not involve hypocrisy, pretense, or disdain.

source: སྦྱིན་གནས་ སམ །_ སྦྱིན་གནས་ མ་ཡིན་པ འམ །_ མངོན་པར་ ཤེས་པ འམ །_ མངོན་པར་ ཤེས་པ་ མ་ཡིན་པ འམ །_ |#| ཚུལ་ཁྲིམས་ དང་ ལྡན་པ འམ །_ ཚུལ་ཁྲིམས་ འཆལ་པ འམ །_ འདྲིས་པ འམ །_ མ་ འདྲིས་པ འམ །_ མཛའ་བ འམ །_ མི་ མཛའ་བ་ ལ་ ཡང་ རུང་ སྟེ |#| བཀུར་སྟི ར་ བྱེད །_ བླ་མ ར་ བྱེད །_ རིམ་གྲོ ར་ བྱེད །_ མཆོད་པ ར་ བྱེད་ |#| ཅིང་
en: Bodhisattvas respect, venerate, serve, and honor the recipients no matter whether or not they are particularly worthy, have superknowledge,#7 |#| have ethical discipline, are familiar to them, or are their relatives.

source: འདུན་པ་ དྲག་པོ་ དང་ །_ དགའ་བ་ དྲག་པོ་ དང་ །_ དད་པ་ དྲག་པོ ས་ དེ་ ཉུང་ངུ་ བདོག་ ན་ ཡང་ ཉུང་ངུ་ སྦྱིན །_
en: With great inspiration, intense joy, and strong faith, they give little if they possess#8 but little,

source: མང་ དུ་ བདོག་ ན་ ཡང་ མང་ དུ་ སྦྱིན །_
en: they give much if they possess much,

source: བཟང་ དུ་ བདོག་ ན་ ཡང་ བཟང་ དུ་ སྦྱིན །_
en: they give excellent things if they possess excellent things,#9

source: ངན་པ་ བདོག་ ན་ ཡང་ ངན་པ་ སྦྱིན །_
en: they give modest things if they possess but modest things,

source: གྱ་ནོམ་པ་ བདོག་ ན་ ཡང་ གྱ་ནོམ་པ་ སྦྱིན་ ནོ །_།
en: and they give exquisite things if they possess exquisite things.

source: ལག་ བཟངས་ ཇི་ལྟ ར་ བྱང་ཆུབ་ སེམས་དཔའ་ བརྒྱ་ སྟོང་ སྦྱིན་པ་ དང་ །_ རླབས་པོ་ཆེ འི་ སེམས་ དང་ །_ རངས་པ འི་ སེམས་ ཀྱིས་ སྦྱིན་པ་ དེ་བཞིན་ དུ་ ཀཱ་ ཀ་ ནི་ ཙམ་ ཡང་ སྦྱིན་ ཞིང་ རླབས་པོ་ཆེ འི་ སེམས་ དང་ །_ རངས་པ འི་ སེམས་ ཀྱིས་ སྦྱིན་ ནོ །_།
en: Subāhu, just as bodhisattvas give one hundred thousand gifts with a magnanimous and cheerful attitude, so do they give a simple coin with a magnanimous and cheerful attitude.

source: དེས་ ཟས་ འདོད་པ་ རྣམས་ ལ་ སེམས་ཅན་ ཐམས་ཅད་ ཐམས་ཅད་ མཁྱེན་ [155a] པ འི་ ཡེ་ཤེས་ བླ་ ན་ མེད་པ འི་ སྟོབས་ ཀྱིས་ བརྟན་པ་ ཐོབ་པ ར་ བྱ་བ འི་ ཕྱིར་ ཟས་ སྦྱིན་ ནོ །_།
en: $5 “To enable all beings to gain stability through the strength of the unsurpassed wisdom of omniscience, bodhisattvas give nourishment to those who desire nourishment. [155.a]

source: སྐོམ་ འདོད་པ་ རྣམས་ ལ་ ནི་ སེམས་ཅན་ ཐམས་ཅད་ ཉོན་མོངས་པ འི་ སྐོམ་པ་ ཐམས་ཅད་ བསལ་བ འི་ སྟོབས་ ཐོབ་པ ར་ བྱ་བ འི་ ཕྱིར་ སྐོམ་ སྦྱིན་ ནོ །_།
en: To enable all beings to gain the strength that entirely quenches the thirst of afflictions, they give drink to those who desire drink.

source: གོས་ འདོད་པ་ རྣམས་ ལ་ ནི་ སེམས་ཅན་ ཐམས་ཅད་ ངོ་ཚ་ ཤེས་པ་ དང་ ཁྲེལ་ཡོད་པ འི་ གོས་ ཐོབ་པ ར་ བྱ་བ འི་ ཕྱིར་ གོས་ སྦྱིན་ ནོ །_།
en: To enable all beings to acquire the clothing of shame and decency, they give clothing to those who desire clothing.

source: བཞོན་པ་ འདོད་པ་ རྣམས་ ལ་ ནི་ སེམས་ཅན་ ཐམས་ཅད་ བྱང་ཆུབ་ སེམས་དཔ འི་ ཐེག་པ་ དང་ །_ རྫོགས་པ འི་ སངས་རྒྱས་ ཀྱི་ ཐེག་པ་ བླ་ ན་ མེད་པ་ ཐོབ་པ ར་ བྱ་བ འི་ ཕྱིར་ བཞོན་པ་ སྦྱིན་ ནོ །_།
en: To enable all beings to acquire the vehicle of bodhisattvas and the unsurpassed vehicle of complete buddhas, they give mounts to those who desire mounts.

source: སྤོས་ འདོད་པ་ རྣམས་ ལ་ ནི་ སེམས་ཅན་ ཐམས་ཅད་ སངས་རྒྱས་ ཀྱི་ ཚུལ་ཁྲིམས་ ཀྱི་ དྲི་བསུང་ ཐམས་ཅད་ ཐོབ་པ ར་ བྱ་བ འི་ ཕྱིར་ སྤོས་ སྦྱིན་ ནོ །_།
en: To enable all beings to acquire the fragrance of the buddhas’ ethical discipline, they give perfume to those who desire perfume.

source: མེ་ཏོག་ འདོད་པ་ རྣམས་ ལ་ ནི་ སེམས་ཅན་ ཐམས་ཅད་ དེ་བཞིན་ གཤེགས་པ འི་ བྱང་ཆུབ་ ཀྱི་ ཡན་ལག་ བདུན་ གྱི་ མེ་ཏོག་ བླ་ ན་ མེད་པ་ ཐོབ་པ ར་ བྱ་བ འི་ ཕྱིར་ མེ་ཏོག་ རྣམས་ སྦྱིན་ ནོ །_།
en: To enable all beings to acquire the unsurpassable flower of the thus-gone ones’ seven branches of awakening, they give flowers to those who desire flowers.

source: ཕྱེ་མ་ འདོད་པ་ རྣམས་ ལ་ ནི་ སེམས་ཅན་ ཐམས་ཅད་ ཉེས་པ ར་ སྤྱོད་པ འི་ དྲི་ང་བ འི་ དྲི་མ་ གཞོམ་པ འི་ སྟོབས་ ཐོབ་པ ར་ བྱ་བ འི་ ཕྱིར་ ཕྱེ་མ་ སྦྱིན་ ནོ །_།
en: To enable all#10 beings to gain the strength of overcoming the stench of wrongdoing, they give fragrant powder to those who desire fragrant powder.

source: བྱུག་པ་ འདོད་པ་ རྣམས་ ལ་ ནི་ སེམས་ཅན་ ཐམས་ཅད་ ཉེས་པ་ མེད་པ འི་ ཚུལ་ཁྲིམས་ དང་ སྤྱོད་པ འི་ བྱུག་པ་ ཐོབ་པ ར་ བྱ་བ འི་ ཕྱིར་ བྱུག་པ་ སྦྱིན་ ནོ །_།
en: To enable all beings to acquire the unguent of faultless ethical discipline and conduct, they give scented unguents to those who desire scented unguents.

source: གདུགས་ འདོད་པ་ རྣམས་ ལ་ ནི་ སེམས་ཅན་ ཐམས་ཅད་ ཉོན་མོངས་པ འི་ གདུང་བ་ ཐམས་ཅད་ ཉེ་བ ར་ ཞི་བ འི་ སྟོབས་ ཐོབ་པ ར་ བྱ་བ འི་ ཕྱིར་ གདུགས་ སྦྱིན་ ནོ །_།
en: To enable all beings to acquire the strength that thoroughly pacifies any torment of afflictions, they give parasols to those who desire parasols.

source: ལྷམ་ འདོད་པ་ རྣམས་ ལ་ ནི་ སེམས་ཅན་ ཐམས་ཅད་ བླ་ ན་ མེད་པ འི་ བདེ་བ་ མངོན་པར་ ཤེས་པ་ ཐོབ་པ ར་ བྱ་བ འི་ ཕྱིར་ ལྷམ་ སྦྱིན་ ནོ །_།
en: To enable all beings to attain the unsurpassable comfort of superknowledge,#11 they give shoes to those who desire shoes.

source: མལ་ཆ་ འདོད་པ་ རྣམས་ ལ་ ནི་ སེམས་ཅན་ ཐམས་ཅད་ ལྷ་ དང་ །_ ཚངས་པ་ དང་ །_ འཕགས་པ འི་ གནས་པ འི་ མལ་ཆ འི་ བདེ་བ ར་ སྦྱར་བ འི་ སྟོབས་ ཐོབ་པ ར་ བྱ་བ འི་ ཕྱིར་ མལ་ཆ་ སྦྱིན་ ནོ །_།
en: To enable all beings to gain the strength to prepare for the comfort of bedding in the abodes of the gods, Brahmā, and the noble ones, they give bedding to those who desire bedding.

source: སྟན་ འདོད་པ་ རྣམས་ ལ་ ནི་ སེམས་ཅན་ ཐམས་ཅད་ བྱང་ཆུབ་ ཀྱི་ སྙིང་པོ ར་ བདུད་ དང་ ཉོན་མོངས་པ འི་ སྒྲིབ་པ་ བར་ དུ་ གཅོད་པ་ ཐམས་ཅད་ ཀྱིས་ མི་ཕྱེད་པ །_ དཔའ་བ འི་ སྟན་ ཐོབ་པ ར་ བྱ་བ འི་ ཕྱིར་ སྟན་ སྦྱིན་ ནོ །_།
en: To enable all beings to acquire the throne of the Hero, the seat of awakening unmoved by all the obstacles of māras and afflictions, they give seats to those who desire seats.

source: གནས་ འདོད་པ་ རྣམས་ ལ་ ནི་ སེམས་ཅན་ ཐམས་ཅད་ སྐྱབས་ དང་ །_ གནས་ [155b] དང་ །_ མགོན་ དང་ །_ དཔུང་གཉེན་ དུ་ གྱུར་པ འི་ ལུས་ ཐོབ་པ ར་ བྱ་བ འི་ ཕྱིར་ གནས་ སྦྱིན་ ནོ །_།
en: To enable all beings to attain bodies that will serve as shelter, abode, protection, and refuge, they give shelter to those who desire shelter. [155.b]

source: ཕྲུ་ ཏོག་ དང་ །_ བུམ་པ་ དང་ །_ འཚོག་ ཆས་ འདོད་པ་ རྣམས་ ལ་ ནི་ སེམས་ཅན་ ཐམས་ཅད་ ཆོས་ ཀྱི་ རྫིང་ ལྟ་བུ འི་ ལུས་ ཐོབ་པ ར་ བྱ་བ འི་ ཕྱིར་ ཕྲུ་ ཏོག་ དང་ །_ བུམ་པ་ དང་ །_ འཚོག་ ཆས་ སྦྱིན་ ནོ །_།
en: To enable all beings to attain bodies that will serve as reservoirs for the Dharma, they give pots, vases, and utensils to those who desire them.

source: སེམས་ཅན་ ཐམས་ཅད་ ཞི་བ་ དང་ ཉེ་བ ར་ ཞི་བ་ བླ་ ན་ མེད་པ འི་ ཏིང་ངེ་འཛིན་ དང་ སྙོམས་པ ར་ འཇུག་པ་ ཐམས་ཅད་ ཐོབ་པ ར་ བྱ་བ འི་ ཕྱིར་ སངས་རྒྱས་ དང་ །_ ཆོས་ དང་ །_ དགེ་འདུན་ ལ་ དཀའ་ཐུབ་ ཀྱི་ ནགས་ཚལ་ སྦྱིན་པ་ སྦྱིན་ ནོ །_།
en: $6 To enable all beings to attain all the absorptions and attainments of unsurpassed tranquility and quiescence, bodhisattvas give the gift of groves for ascetic practice to the Buddha, Dharma, and Saṅgha.

source: སེམས་ཅན་ ཐམས་ཅད་ སྐྱེས་བུ་ ཆེན་པོ འི་ མཚན་ སུམ་ཅུ་རྩ་གཉིས་ དང་ །_ དཔེ་བྱད་ བཟང་པོ་ བརྒྱད་ཅུ་ ཐོབ་པ ར་ བྱ་བ འི་ ཕྱིར་ མཆོད་རྟེན་ རྣམས་ ལ་ རྒྱན་ སྦྱིན་པ་ སྦྱིན་ ནོ །_།
en: To enable all beings to attain the thirty-two major and eighty minor marks of a great man, they give the gift of adornments to stūpas.

source: སེམས་ཅན་ ཐམས་ཅད་ དེ་བཞིན་ གཤེགས་པ འི་ ལྷ འི་ སྤྱན་ མཐའ་ཡས་པ་ ཐོབ་པ ར་ བྱ་བ འི་ ཕྱིར་ མུན་ཁྲོད་ ཀྱི་ མཆོད་རྟེན་ ནམ་ ལམ་ རྣམས་ ལ་མ ར་ མེ འི་ སྦྱིན་པ་ སྦྱིན་ ནོ །_།
en: To enable all beings to gain the limitless divine vision of the thus-gone ones, they give the gift of lamps at darkened stūpas and paths.

source: སེམས་ཅན་ ཐམས་ཅད་ དེ་བཞིན་ གཤེགས་པ འི་ ལྷ འི་ སྙན་ མཐའ་ཡས་པ་ ཐོབ་པ ར་ བྱ་བ འི་ ཕྱིར་ སངས་རྒྱས་ ལ་ མཆོད་པ་ རྣམས་ སམ །_ ཆོས་ ལ་ མཆོད་པ་ རྣམས་ སམ །_ དགེ་འདུན་ ལ་ མཆོད་པ་ རྣམས་ ལ་ རོལ་མོ འི་ དབྱངས་ སྒྲ་ སྦྱིན་པ་ སྦྱིན་ ནོ །_།
en: To enable all beings to acquire the limitless divine hearing of the thus-gone ones, they give the gift of melodious music in their worship of the Buddha, Dharma, and Saṅgha.

source: སེམས་ཅན་ ཐམས་ཅད་ ཆ་བྱད་ དང་ །_ ཚུལ་ཁྲིམས་ དང་ །_ སྤྱོད་པ་ མཛེས་པ་ བླ་ ན་ མེད་པ་ ཐོབ་པ ར་ བྱ་བ འི་ ཕྱིར་ ལྷུང་བཟེད་ དང་ ཆོས་གོས་ སྦྱིན་པ་ སྦྱིན་ ནོ །_།
en: To enable all beings to gain unsurpassed, exquisite appearance, ethical discipline, and conduct, bodhisattvas give the gift of alms bowls and monastic robes.

source: སེམས་ཅན་ ཐམས་ཅད་ དབུགས་དབྱུང་བ་ སྦྱིན་པ འི་ སྟོབས་ ཐོབ་པ ར་ བྱ་བ འི་ ཕྱིར་ སྣོད་ ཚགས་ སྦྱིན་པ་ སྦྱིན་ ནོ །_།
en: To enable all beings to gain the power to give relief, they give the gift of sieves.

source: སེམས་ཅན་ ཐམས་ཅད་ ཤེས་རབ་ ཆེན་པོ འི་ ཚོགས་ ཡོངས་སུ་ བསྐང་བ་ ཐོབ་པ ར་ བྱ་བ འི་ ཕྱིར་ མྱུ་གུ་ དང་ །_ སྣག་ཚ་ དང་ །_ གླེགས་བུ་ དང་ །_ ཆོས་ ཀྱི་ ཁྲི་སྟན་ སྦྱིན་པ་ སྦྱིན་ ནོ །_།
en: To enable all beings to attain the completion of the accumulation of great insight, they give the gift of reed brushes, ink, palm leaves, and Dharma seats.

source: སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ ཉོན་མོངས་པ འི་ ནད་ ཐམས་ཅད་ གཞོམ་པ འི་ ཕྱིར་ ན་བ འི་ གསོས་ སྨན་ དང་ །_ ཡོ་བྱད་ སྦྱིན་པ་ སྦྱིན་ ནོ །_།
en: To eliminate all the illnesses of afflictions from all beings, bodhisattvas give the gift of medicines to cure the sick and other standard resources.

source: སེམས་ཅན་ ཐམས་ཅད་ བྱང་ཆུབ་ རྣམ་པ་ གསུམ་ གྱི་ ས་ དང་ །_ བདུད་རྩི འི་ དབྱིངས་ ཀྱི་ ས་ ཐོབ་པ ར་ བྱ་བ འི་ ཕྱིར་ ས་ སྦྱིན་པ་ སྦྱིན་ ནོ །_།
en: To enable all beings to attain the ground of the three kinds of awakening and the ground of the expanse of ambrosia, they give the gift of land.

source: སེམས་ཅན་ ཐམས་ཅད་ སློབ་དཔོན་ མེད་པ འི་ དམ་པ འི་ ཆོས་ མཐོན་པོ་ ཐོབ་པ ར་ བྱ་བ འི་ ཕྱིར་ མཆོད་རྟེན་ [156a] མཐོན་པོ་ དང་ །_ སྐུ་གཟུགས་ མཐོན་པོ་ བྱེད་ དོ །_།
en: To enable all beings to obtain the lofty, sublime Dharma without a teacher, [156.a] they build lofty stūpas and statues.

source: བདོག་པ་ ལྟ་ ན་ སེམས་ཅན་ ཐམས་ཅད་ མངོན་པར་ ཤེས་པ་ མྱུར་བ་ ཐོབ་པ ར་ བྱ་བ འི་ ཕྱིར་ མྱུར་ ཞིང་ ཡོངས་སུ་ ཉོན་མོངས་ པར་མ་ གྱུར་པ ར་ སྦྱིན་པ་ སྦྱིན་ ནོ །_།
en: $7 “To enable all beings to quickly acquire the different kinds of superknowledge upon seeing what they have acquired, bodhisattvas give gifts quickly and without reluctance.#12

source: སེམས་ཅན་ ཐམས་ཅད་ བར་ དུ་ གཅོད་པ་ མེད་པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཐོབ་པ ར་ བྱ་བ འི་ ཕྱིར་ རུང་བ་ སྦྱིན་ གྱི་ རུང་བ་ མ་ཡིན་པ་ ནི་ མ་ ཡིན་ ནོ །_།
en: To enable beings to attain complete awakening without hindrance, they give suitable gifts, not unsuitable ones.

source: སེམས་ཅན་ ཐམས་ཅད་ སྤོབས་པ་ ཆེན་པོ་ ཡོངས་སུ་ མི་འཆད་པ་ ཐོབ་པ ར་ བྱ་བ འི་ ཕྱིར་ ཡོངས་སུ་ མི་ གཅོད་པ ར་ སྦྱིན་པ་ སྦྱིན་ ནོ །_།
en: To enable all beings to acquire unimpeded great eloquence, they give gifts limitlessly.

source: སེམས་ཅན་ ཐམས་ཅད་ སྙིང་རྗེ་ ཆེན་པོ་ མཚུངས་པ་ མེད་པ་ ཐོབ་པ ར་ བྱ་བ འི་ ཕྱིར་ སེམས་ཅན་ ཐམས་ཅད་ ལ་ མཉམ་པ ར་ སྦྱིན་པ་ སྦྱིན་ ནོ །_།
en: To enable all beings to acquire unparalleled great compassion, they give equally to all beings.

source: སེམས་ཅན་ ཐམས་ཅད་ བདུད་ དང་ མུ་སྟེགས་ བྱེད་ ཐམས་ཅད་ ཀྱིས་ ཚར་ མི་ ཆོད་པ་ དང་ །_ གནོད་པ ར་ མི་ ནུས་པ འི་ ཆོས་ མངོན་པར་ རྫོགས་པ ར་ བྱང་ཆུབ་ པར་ བྱ་བ འི་ ཕྱིར་ གཞན་ ལ་ མི་ གནོད་པ ར་ སྦྱིན་པ་ སྦྱིན་ ནོ །_།
en: To enable all beings to perfectly and completely awaken to the Dharma that cannot be destroyed or harmed by any māras or non-Buddhists, bodhisattvas give gifts that do no harm to others.

source: ལག་ བཟངས་ གལ་ཏེ་ བྱང་ཆུབ་ སེམས་དཔའ་ ལ་ སྦྱིན་པ་ འདི་དག་ སྦྱིན་ དུ་ ནོར་མེད་ ཅིང་ འབྱོར་བ་ མེད་པར་ གྱུར་ ན །_
en: $8 “Subāhu, if bodhisattvas are without the wealth and means to give these gifts,

source: དེ་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཐམས་ཅད་ དུ་ སེམས་ཅན་ ཐམས་ཅད་ ལ་ སྦྱིན་པ་ མཐའ་ ཡ ས་ ཤིང་ དཔག་ ཏུ་ མེད་པ་ འདི་དག་ སྦྱིན་པ ར་ ཡིད་ ཀྱིས་ འདོད་ ཅིང་ སྨོན་ ལ་ སྨོན་ལམ་ འདེབས་ ཏེ །_
en: they make aspirations, mentally yearning and wishing to give these limitless, immeasurable gifts to all beings throughout all world systems.

source: ལག་ བཟངས་ བྱང་ཆུབ་ སེམས་དཔའ་ དེ་ སྦྱིན་པ་ འདི་དག་ སྦྱིན་པ འི་ ནུས་པ་ དང་ ལྡན་ ཡང་ རུང་ །_ ནུས་པ་ དང་ མི་ ལྡན་ ཡང་ རུང་ སྟེ །_
en: Subāhu, whether or not bodhisattvas have the capacity to give these gifts, they make aspirations, mentally yearning and wishing as follows:

source: གང་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཐམས་ཅད་ ན་ སེམས་ཅན་ ཐམས་ཅད་ བདག་ གི་ བདེ་བ་ སྦྱར་བ་ ཉིད་ དང་ ལྡན་པ་ དང་ །_
en: ‘May all beings throughout all world systems become connected to and filled with my own happiness!

source: ཡང་དག་ པར་ ལྡན་པ ར་ གྱུར་ ཅིང་ འབད་པ་ མེད་པ་ དང་ །_
en: May absolutely all their intentions be effortlessly fulfilled in all ways,#13 and

source: འདོད་པ་ མེད་པར་ བརྣག་པ་ རྣམས་ ཐམས་ཅད་ ཀྱི་ ཐམས་ཅད་ རྣམ་པ་ ཐམས་ཅད་ ཀྱི་ ཐམས་ཅད་ དུ་ ཤིན་ཏུ་ ཡོངས་སུ་ རྫོགས་ ཤིང་ བསམ་པ་ མ་ལུས་པ ར་ ཡོངས་སུ་ རྫོགས་ ནས་ བདེ་བ་ ལ་ རེག་པ ར་ གནས་པ ར་ འགྱུར་བ ར་
en: may all their wishes without exception be fulfilled, so that they may abide in happiness!

source: བདག་ གི་ དེ་ བཟང་པོ ར་ གྱུར་ཅིག _།
en: May this aspiration of mine be auspicious!

source: བདག་ གི་ དེ་ དགེ་བ ར་ གྱུར་ཅིག་
en: May this aspiration of mine be virtuous!’

source: ཅེས་ དེ་ལྟ ར་ ཡིད་ ཀྱིས་ འདོད་ ཅིང་ སྨོན་ ལ་ སྨོན་ལམ་ འདེབས་ སོ །_། འཇིག་རྟེན་ གྱི་ ཁམས་ ཐམས་ཅད་ དུ་ སེམས་ཅན་ ཐམས་ཅད་ ལ་ རིན་པོ་ཆེ འི་ རྒྱ་མཚོ་ ཡང་ སྦྱིན་པ ར་ འདོད་ ཅིང་ [156b] སྨོན་ ལ་ སྨོན་ལམ་ འདེབས་ སོ །_།
en: $9 “Bodhisattvas make such aspirations, [156.b] yearning and wishing to give oceans of jewels to all beings throughout all world systems.

source: དབྱིག་ གི་ རི་ དང་ །_ གསེར་ གྱི་ རི་ དང་ །_ གོས་ ཀྱི་ རི་ དང་ །_ ཡོ་བྱད་ ཐམས་ཅད་ ཀྱི་ རི་ དང་ །_ བཟའ་བ་ རྒྱ་མཚོ་ དང་ །_ བཏུང་བ་ རྒྱ་མཚོ་ དང་ །_ གནས་ ལེགས་པ ར་ བྱས་པ །_ ལེགས་པ ར་ གནས་པ །_ མཐའ་ ཡ ས་ ཤིང་ དཔག་ ཏུ་ མེད་པ་ དག་ ཀྱང་ སྦྱིན་པ ར་ འདོད་ ཅིང་ སྨོན་ ལ་ སྨོན་ལམ་ འདེབས་ སོ །_།
en: Bodhisattvas make aspirations, yearning and wishing to give endless, immeasurable mountains of wealth, mountains of gold, mountains of clothing, mountains of all utensils, oceans of food, oceans of drink, and finely wrought abodes where one can comfortably dwell.

source: འཁོར་བ འི་ སྲིད་པ་ ཐམས་ཅད་ ཀྱི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཐམས་ཅད་ ཀྱི་ སེམས་ཅན་ འདས་པ་ དང་ །_ མ་འོངས་པ་ དང་ །_ ད་ལྟ ར་ བྱུང་བ་ ཐམས་ཅད་ ཀྱི་ སྦྱིན་པ་ དང་ །_ གཏོང་བ་ དང་ །_ རྣམ་པར་ གཏོང་བ་ གང་ཡིན་པ་ ཟང་ཟིང་ སྦྱིན་པ་ འམ །_ མི་ འཇིགས་པ་ སྦྱིན་པ་ འམ །_ ཆོས་སྦྱིན་པ་ མ་ལུས་པ་ དེ་དག་ ཐམས་ཅད་ ལ་ ཐ་ན་ དུས་གསུམ་ དུ་ ཡང་ མངོན་པར་ དགའ་ ཞིང་ རྗེས་སུ་ ཡི་ རང་ ངོ་ །_།
en: They also delight and rejoice at least three times a day in all the acts of giving, offering, and bestowing material possessions, protection from fear, and the gifts of Dharma performed by all beings of the past, future, and present throughout all the world systems in the entirety of cyclic existence.

source: གལ་ཏེ་ དེ་ ལ་ བསླངས་ ལ་ ནོར་སྦྱིན་ མི་ ནུས་ ན་ ཡང་ རང་ གི་ ཟན་ སྐལ་ སྦྱིན་པ འམ །_ གྲོགས་ སུ་ འགྱུར་བ་ འམ །_
en: $10 “Even if bodhisattvas are unable to give wealth to those who request it, they offer them their own share of food, provide them with assistance,

source: ཀུན་ དུ་ བཙལ་བ འི་ ཐབས་ ཀྱང་ དེ་ ལ་ སྟོན་པ ར་ འགྱུར་ ཞིང་
en: or show them the means to seek what they want, and

source: ཆོས་ ཀྱི་ གཏམ་ གྱིས་ དེ འི་ འདོད་པ་ སེལ་བར་ བྱེད་ དོ །_།
en: then eradicate their desire with a Dharma discourse.

source: དེ་ སྦྱིན་པ ར་ འདོད་པ ར་ གྱུར་པ་ ན་ ཡང་ སྦྱིན་པ་ དེ་ སེམས་ཅན་ ཐམས་ཅད་ བསྒྲལ་བ་ དང་ །_ སེམས་ཅན་ ཐམས་ཅད་ དགྲོལ་བ་ དང་ །_ སེམས་ཅན་ ཐམས་ཅད་ དབུགས་དབྱུང་བ་ དང་ །_ སེམས་ཅན་ ཐམས་ཅད་ ཡོངས་སུ་ མྱ་ངན་ ལས་ བཟླ་བ་ དང་ །_ ཐམས་ཅད་ མཁྱེན་པ་ ཉིད་ ཐོབ་པ ར་ བྱ་བ་ དང་ །_ སངས་རྒྱས་ ཀྱི་ ཆོས་ ཐམས་ཅད་ ཡོངས་སུ་ རྫོགས་པ ར་ བྱ་བ འི་ ཕྱིར་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ཡོངས་སུ་ བསྔོ འོ །_།
en: $11 “Should bodhisattvas even just wish to give those gifts, they dedicate this generosity to unsurpassable, perfect, and complete awakening so that all beings are ferried across, liberated, and relieved, and so that they may transcend suffering, attain omniscience, and perfect all the qualities of a buddha.

source: སྦྱིན་པ་ དེ་ བྱིན་ ནས་ ཀྱང་ སྦྱིན་པ་ དེ་ སེམས་ཅན་ ཐམས་ཅད་ བསྒྲལ་བ་ དང་ །_ སེམས་ཅན་ ཐམས་ཅད་ དགྲོལ་བ་ དང་ །_ སེམས་ཅན་ ཐམས་ཅད་ དབུགས་དབྱུང་བ་ དང་ །_ སེམས་ཅན་ ཐམས་ཅད་ ཡོངས་སུ་ མྱ་ངན་ ལས་ བཟླ་བ་ དང་ །_ ཐམས་ཅད་ མཁྱེན་པ་ ཉིད་ ཐོབ་པ ར་ བྱ་བ་ དང་ །_ སངས་རྒྱས་ ཀྱི་ ཆོས་ ཐམས་ཅད་ ཡོངས་སུ་ རྫོགས་པ ར་ བྱ་བ འི་ ཕྱིར་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ཡོངས་སུ་ བསྔོ འོ །_།
en: Having offered their gift, they again dedicate this generosity to unsurpassable, perfect, and complete awakening so that all beings are ferried across, liberated, and relieved, and so that they may transcend suffering, attain omniscience, and perfect all the qualities of a buddha.

source: གལ་ཏེ་ སྦྱིན་པ་ དང་ །_ གཏོང་བ་ དང་ །_ རྣམ་པར་ གཏོང་བ་ དེ་ ལ་ སློབ་པ འི་ ནུས་པ་ དང་ མི་ ལྡན་པ ར་ གྱུར་ ན་ དེ་ འདི་ལྟར་ ཡང་དག་ པར་ སློབ་ སྟེ །_
en: $12 “Should bodhisattvas lack the capacity to train in giving, offering, and bestowing, this is how they properly train:

source: དུས་ དུས་ [157a] སུ་ འམ །_ ཅུང་ཟད་ ཅུང་ཟད་ དུ་ ཡང་ ཆགས་པ་ དང་ །_ སེར་སྣ་ དང་ །_ སྦྱིན་པ ས་ འཇིགས་པ་ སྤང་བ་ དང་ །_ དོར་བ་ དང་ །_ བསལ་བ ར་ རྩོལ་ ལོ །_། འབད་ དོ །_།
en: From time to time, [157.a] or little by little, they strive and exert themselves in abandoning, forsaking, and eliminating attachment, stinginess, and fear of giving.

source: དུས་ དུས་ སུ་ འམ །_ ཅུང་ཟད་ ཅུང་ཟད་ དུ་ ཡང་ སྦྱིན་པ་ དང་ །_ གཏོང་བ་ དང་ །_ རྣམ་པར་ གཏོང་བ་ ལ་ སློབ་པ་ དང་ །_ མངོན་པར་ འཕེལ་བ ར་ བྱ་བ་ དང་ །_ ཡོངས་སུ་ རྫོགས་པ ར་ བྱ་བ ར་ རྩོལ་ ལོ །_། འབད་ དོ །_།
en: From time to time, or little by little, they also strive and exert themselves in training, developing, and perfecting the acts of giving, offering, and bestowing.

source: སྲིད་པ་ གཞན་ དུ་ གྱུར་པ་ ན་ ཡང་ ཞུམ་པ ར་ མི་ འགྱུར་ ཞིང་ སྒྱིད་ལུག་ པར་ མི་ འགྱུར་ རོ །_།
en: Even when they take another birth, they do not lose heart or become discouraged.

source: ལག་ བཟངས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ བྱང་ཆུབ་ ཏུ་ སེམས་བསྐྱེད་པ་ དང་ །_ |#| བྱང་ཆུབ་ ཀྱི་ སེམས་ རྗེས་སུ་ དྲན་པ་ དང་ །_ བྱང་ཆུབ་ ཀྱི་ སེམས་ བསྒོམ་པ་ དང་ །_ |#| བྱང་ཆུབ་ ཏུ་ སྨོན་པ་ དང་ །_ བྱང་ཆུབ་ ཏུ་ སྨོན་ལམ་ འདེབས་པ་ གང་ཡིན་པ་ དེ་ཉིད་ དེ་དག་ གི་ སྦྱིན་པ་ ཆེན་པོ་ དང་ །_ |#| གཏོང་བ་ ཆེན་པོ་ དང་ །_ རྣམ་པར་ གཏོང་བ་ ཆེན་པོ་ གྲངས་མེད་ ཅིང་ དཔག་ ཏུ་ མེད་པ་ ཡིན་ ནོ །_།
en: Subāhu, bodhisattvas’ formation of the resolve to awaken, |#| their recollection and cultivation of the resolve to awaken, and |#| their wishes and aspirations to awaken are themselves their immeasurable, |#| incalculable great acts of giving, offering, and bestowing.

source: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན །_
en: Why is that?

source: འདི་ལྟ་སྟེ །_ |#| འཇིག་རྟེན་ གྱི་ ཁམས་ ཐམས་ཅད་ དུ་ སེམས་ཅན་ ཐམས་ཅད་ ལ་ དམ་པ འི་ ཆོས་ ཀྱི་ ཆར་ སྦྱིན་པ ར་ འདོད་པ་ དང་ །_ བདུད་རྩི འི་ དབྱིངས་ ཀྱི་ ཆར་ སྦྱིན་པ ར་ འདོད་པ་ དང་ །_ དམ་པ འི་ ཆོས་ ཀྱི་ ཆར་ གཏོང་བ ར་ འདོད་པ་ དང་ །_ བདུད་རྩི འི་ དབྱིངས་ ཀྱི་ ཆར་ གཏོང་བ ར་ འདོད་པ་ དང་ །_ དམ་པ འི་ ཆོས་ ཀྱི་ ཆར་ རྣམ་པར་ གཏོང་བ ར་ འདོད་པ་ དང་ །_ བདུད་རྩི འི་ དབྱིངས་ ཀྱི་ ཆར་ རྣམ་པར་ གཏོང་བ ར་ འདོད་པ་ དེ་ ནི་ སྦྱིན་པ་ དང་ །_ གཏོང་བ་ དང་ །_ རྣམ་པར་ གཏོང་བ་ ཐམས་ཅད་ ཀྱི་ ནང་ ན་ མཆོག་ ཡིན་ ནོ །_། དེ་ ནི་ དམ་པ་ ཡིན་ ནོ །_།
en: It is because among all acts of giving, offering, and bestowing, the foremost and supreme is the wish to give, offer, and bestow to all beings in all world systems a shower of sublime Dharma and a shower of the expanse of ambrosia.

source: ལག་ བཟངས་ དེ་ལྟ ར་ ན་ བྱང་ཆུབ་ སེམས་དཔའ་ བདེ་བ་ དང་ ལྡན་ ལ་ ཡིད་ བདེ་བ་ དང་ །_ ལྡན་ ཞིང་ ཚེགས་ ཆུང་ངུ་ དང་ །_ སྡུག་བསྔལ་ ཆུང་ངུ ས་ མྱུར་ དུ་ སྐྱེན་པ ར་ སྦྱིན་པ འི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ ཡོངས་སུ་ རྫོགས་པ ར་ བྱེད་ དོ །_།
en: $13 “Subāhu, in this way bodhisattvas will very quickly complete the perfection of generosity, with ease and pleasure, little difficulty, and little pain.

source: ལག་ བཟངས་ བྱང་ཆུབ་ སེམས་དཔའ་ ནི་ སློང་བ་ རྣམས་ ཀྱིས་ བསླངས་པ་ ན་ ཡན་ལག་ དང་ ཉིང་ལག་ གཅོད་ དམ །_ བཅད་ ནས་ སློང་བ་ རྣམས་ ལ་ སྦྱིན་པ ར་ མི་ བྱེད་ དོ །_།
en: $14 “Subāhu, bodhisattvas do not cut off limbs or other body parts when requested by beggars, nor would they offer them to beggars, even if they were cut off.
